post/manage-ssh-passphrase-with-gpg/index.html
<!DOCTYPE html>
<html lang="vi-vn">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title> Quản lý mật khẩu ssh-key bằng GnuPG | MẤY KHI MẤY KHỈ</title>
  
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="robots" content="all,follow">
  <meta name="googlebot" content="index,follow,snippet,archive">
  <meta property="og:title" content="Quản lý mật khẩu ssh-key bằng GnuPG" />
<meta property="og:description" content="Vấn đề  Mình sử dụng nhiều ssh-key cho các dự án khác nhau. Mỗi key mình đều đặt passphrase cũng khác nhau.
 Vấn đề nảy sinh là nhiều key thì nhiều pass, mà mình hay dùng GnuPG để quản lý các secret nên muốn quy nó về 1 mối luôn. Giống như việc sử dụng KeePass để quản lý các mật khẩu. (Có khi KeePass lại có plugin cho việc quản lý ssh-keys, chưa tìm hiểu)" />
<meta property="og:type" content="article" />
<meta property="og:url" content="/post/manage-ssh-passphrase-with-gpg/" />
<meta property="article:published_time" content="2024-05-06T13:47:16+07:00" />
<meta property="article:modified_time" content="2024-05-06T13:47:16+07:00" />

  <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Quản lý mật khẩu ssh-key bằng GnuPG"/>
<meta name="twitter:description" content="Vấn đề  Mình sử dụng nhiều ssh-key cho các dự án khác nhau. Mỗi key mình đều đặt passphrase cũng khác nhau.
 Vấn đề nảy sinh là nhiều key thì nhiều pass, mà mình hay dùng GnuPG để quản lý các secret nên muốn quy nó về 1 mối luôn. Giống như việc sử dụng KeePass để quản lý các mật khẩu. (Có khi KeePass lại có plugin cho việc quản lý ssh-keys, chưa tìm hiểu)"/>

  
  
    
  
  
  <link rel="stylesheet" href="/css/style-light.css">
  
  
  
    <!--[if lt IE 9]>
    <![endif]-->
  

  
<link rel="icon" type="image/png" href="/images/favicon.ico" />

  
  
</head>

<body class="max-width mx-auto px3 ltr">
  <div class="content index py4">

    <header id="header">
  <a href="/">
  
    <div id="logo" style="background-image: url(https://avatars.githubusercontent.com/u/9713793?s=64)"></div>
  
  <div id="title">
    <h1>MẤY KHI MẤY KHỈ</h1>
  </div>
  </a>
  <div id="nav">
    <ul>
      <li class="icon">
        <a href="#"><i class="fas fa-bars fa-2x"></i></a>
      </li>
      
        <li><a href="/post/intro">Intro</a></li>
      
        <li><a href="/post">Writings</a></li>
      
    </ul>
  </div>
</header>



    
<article class="post" itemscope itemtype="http://schema.org/BlogPosting">

  <div class="content" itemprop="articleBody">
  
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Vấn đề
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Mình sử dụng nhiều ssh-key cho các dự án khác nhau. Mỗi key mình đều đặt passphrase cũng khác nhau.</p>
<p>
Vấn đề nảy sinh là nhiều key thì nhiều pass, mà mình hay dùng GnuPG để quản lý các secret nên muốn quy nó về 1 mối luôn.
Giống như việc sử dụng KeePass để quản lý các mật khẩu. (Có khi KeePass lại có plugin cho việc quản lý ssh-keys, chưa tìm hiểu)</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Giải quyết
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Từng nghĩ tạo ssh key trong tính năng của GnuPG luôn. Nhưng xong thấy nó đi theo cặp (bị lock) không ưng lắm.
Phương án tiếp theo là lấy cảm hứng từ <code>Emacs</code>, lưu password vào tệp <code>.authinfo.gpg</code>, nó cũng là 1 dạng password management.</p>
<p>
<code>ssh-add</code> cung cấp 2 biến mỗi trường <code>SSH_ASKPASS</code> và <code>SSH_ASKPASS_REQUIRE</code> để ta có thể control được phần điền mật khẩu. Cool.</p>
<ul>
<li>
<p>Tạo 1 script <code>/usr/local/bin/gpg-ask-pass-for-ssh.sh</code> để handle công việc lấy pass từ <code>~/.authinfo.gpg</code> như sau</p>
</li>
</ul>
<div class="src src-sh">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh"><span style="color:#75715e">#!/usr/bin/env bash
</span><span style="color:#75715e"></span>input<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span>$@<span style="color:#e6db74">&#34;</span>
<span style="color:#75715e"># input=&#34;Enter passphrase for ~/.ssh/id_rsa:&#34;</span>
real_keyname<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>echo $input | awk -F<span style="color:#e6db74">&#39; &#39;</span> <span style="color:#e6db74">&#39;{print $4}&#39;</span><span style="color:#66d9ef">)</span>
<span style="color:#75715e"># Get keyname by remove : in end of string and get basename</span>
keyname<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>basename <span style="color:#e6db74">&#34;</span>$real_keyname<span style="color:#e6db74">&#34;</span> | sed <span style="color:#e6db74">&#39;s/:$//&#39;</span><span style="color:#66d9ef">)</span>
<span style="color:#66d9ef">if</span> <span style="color:#f92672">[</span> -z <span style="color:#e6db74">&#34;</span>$keyname<span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
    echo <span style="color:#e6db74">&#34;Keyname is empty&#34;</span>
    exit <span style="color:#ae81ff">1</span>
<span style="color:#66d9ef">fi</span>

<span style="color:#75715e"># use gpg to decrypt ~/.authinfo.gpg then get password from line match with ssh/keyname</span>
gpg -q -d ~/.authinfo.gpg | grep <span style="color:#e6db74">&#34;ssh/</span><span style="color:#e6db74">${</span>keyname<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span> | awk -F<span style="color:#e6db74">&#39; &#39;</span> <span style="color:#e6db74">&#39;{print $6}&#39;</span></code></pre></div>
</div>
<ul>
<li>
<p>Lưu trữ passphrase vào <code>.authinfo.gpg</code> thôi</p>
</li>
</ul>
<p>Giả sử key ở tại <code>~/.ssh/id_rsa</code></p>
<div class="src src-authinfo">
<pre><code class="language-authinfo" data-lang="authinfo">machine ssh/id_rsa login root password PASSPHRASE_HERE
machine ssh/giaptx@company.blabla login root password PASSPHRASE_HERE_BLABLA</code></pre>
</div>
<p>
Demo:</p>
<div class="src src-sh">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh">eval <span style="color:#66d9ef">$(</span>ssh-agent<span style="color:#66d9ef">)</span>
SSH_ASKPASS<span style="color:#f92672">=</span>/usr/local/bin/gpg-ask-pass-for-ssh.sh
SSH_ASKPASS_REQUIRE<span style="color:#f92672">=</span>force ssh-add ~/.ssh/id_rsa</code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Tổng kết
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Trên đây là cách mình dùng GnuPG để manage các pass cho ssh. Trong thực tế thì mình đã viết 1 function để load ssh-key tiện hơn trong terminal.
Thêm phần link vào các ssh-agent để tránh tạo trùng lặp.</p>
<p>
Cụ thể mình config vào <code>~/.bashrc</code> như sau</p>
<div class="src src-bash">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">export SSH_DIR<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>HOME<span style="color:#e6db74">}</span><span style="color:#e6db74">/.ssh&#34;</span>
use-ssh<span style="color:#f92672">(){</span>
    SSH_ASKPASS<span style="color:#f92672">=</span>/usr/local/bin/gpg-ask-pass-for-ssh.sh
    ssh_key<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>1<span style="color:#66d9ef">:-</span>id_rsa<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[</span> -e <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>SSH_DIR<span style="color:#e6db74">}</span><span style="color:#e6db74">/</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
        ssh_key<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>SSH_DIR<span style="color:#e6db74">}</span><span style="color:#e6db74">/</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span>
    <span style="color:#66d9ef">elif</span> <span style="color:#f92672">[</span> -e <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>PWD<span style="color:#e6db74">}</span><span style="color:#e6db74">/</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
        ssh_key<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>PWD<span style="color:#e6db74">}</span><span style="color:#e6db74">/</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span>
    <span style="color:#66d9ef">elif</span> <span style="color:#f92672">[</span> -e <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
        ssh_key<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span>
    <span style="color:#66d9ef">else</span>
        echo <span style="color:#e6db74">&#34;What is </span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">?&#34;</span>
        <span style="color:#66d9ef">return</span> <span style="color:#ae81ff">1</span>
    <span style="color:#66d9ef">fi</span>
    ssh_key<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>readlink -f <span style="color:#e6db74">&#34;</span>$ssh_key<span style="color:#e6db74">&#34;</span><span style="color:#66d9ef">)</span>
    ssh_name<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>basename <span style="color:#e6db74">&#34;</span>$ssh_key<span style="color:#e6db74">&#34;</span><span style="color:#66d9ef">)</span>
    ssh_md5<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>md5sum <span style="color:#e6db74">&#34;</span>$ssh_key<span style="color:#e6db74">&#34;</span> | cut -f1 -d<span style="color:#e6db74">&#34; &#34;</span><span style="color:#66d9ef">)</span>
    file<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span>$SSH_DIR<span style="color:#e6db74">/</span><span style="color:#e6db74">${</span>ssh_name<span style="color:#e6db74">}</span><span style="color:#e6db74">_</span><span style="color:#e6db74">${</span>ssh_md5<span style="color:#e6db74">}</span><span style="color:#e6db74">.sock&#34;</span>
    echo <span style="color:#e6db74">&#34;Set SSH_AUTH_SOCK=</span>$file<span style="color:#e6db74">&#34;</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[</span> -z <span style="color:#e6db74">&#34;</span>$2<span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span> <span style="color:#f92672">&amp;&amp;</span> <span style="color:#f92672">[</span> -e <span style="color:#e6db74">&#34;</span>$file<span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
        export SSH_AUTH_SOCK<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#66d9ef">$(</span>readlink -f $file<span style="color:#66d9ef">)</span><span style="color:#e6db74">&#34;</span>
        ps1 <span style="color:#e6db74">&#34;ssh:</span>$ssh_name<span style="color:#e6db74">&#34;</span>
        <span style="color:#66d9ef">return</span> <span style="color:#ae81ff">0</span>
    <span style="color:#66d9ef">fi</span>
    eval <span style="color:#66d9ef">$(</span>ssh-agent<span style="color:#66d9ef">)</span>
    SSH_ASKPASS_REQUIRE<span style="color:#f92672">=</span>force ssh-add <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>ssh_key<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span>
    ln -svf <span style="color:#e6db74">&#34;</span>$SSH_AUTH_SOCK<span style="color:#e6db74">&#34;</span> <span style="color:#e6db74">&#34;</span>$file<span style="color:#e6db74">&#34;</span> &gt;&amp; /dev/null
    ps1 <span style="color:#e6db74">&#34;ssh:</span>$ssh_name<span style="color:#e6db74">&#34;</span>
<span style="color:#f92672">}</span>

_use-ssh<span style="color:#f92672">(){</span>
    local cur prev words cword opts
    _get_comp_words_by_ref -n : cur prev words cword
    COMPREPLY<span style="color:#f92672">=()</span>
    opts<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[[</span> <span style="color:#e6db74">${#</span>toks[@]<span style="color:#e6db74">}</span> -ne <span style="color:#ae81ff">0</span> <span style="color:#f92672">]]</span>; <span style="color:#66d9ef">then</span>
        compopt -o filenames 2&gt; /dev/null;
        COMPREPLY<span style="color:#f92672">+=(</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>toks[@]<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span><span style="color:#f92672">)</span>;
    <span style="color:#66d9ef">fi</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[[</span> <span style="color:#e6db74">${</span>cword<span style="color:#e6db74">}</span> -eq <span style="color:#ae81ff">1</span> <span style="color:#f92672">]]</span>;<span style="color:#66d9ef">then</span>
        opts<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>find <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>SSH_DIR<span style="color:#e6db74">}</span><span style="color:#e6db74">/&#34;</span> -name <span style="color:#ae81ff">\*</span>@<span style="color:#ae81ff">\*</span> -exec basename <span style="color:#f92672">{}</span> <span style="color:#ae81ff">\;</span><span style="color:#66d9ef">)</span>
    <span style="color:#66d9ef">fi</span>
    _filedir
    COMPREPLY<span style="color:#f92672">+=(</span> <span style="color:#66d9ef">$(</span>compgen -W <span style="color:#e6db74">&#34;</span>$opts<span style="color:#e6db74">&#34;</span> -- <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>cur<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span><span style="color:#66d9ef">)</span><span style="color:#f92672">)</span>
<span style="color:#f92672">}</span>

complete -F _use-ssh use-ssh</code></pre></div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Lúc dùng chỉ cần gõ:
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>
<p>Với key nằm trong ~/.ssh</p>
</li>
</ul>
<p><code>use-ssh</code> =&gt; Với key măc định là <code>id_rsa</code></p>
<p>
<code>use-ssh giaptx@company.blabla</code></p>
<ul>
<li>
<p>Hoặc với đường dẫn tương đối</p>
</li>
</ul>
<p><code>use-ssh project/ssh-key</code></p>
<ul>
<li>
<p>Hoặc với đưòng dẫn tuyệt đối</p>
</li>
</ul>
<p><code>use-ssh /tmp/key-temporary</code></p>
</div>
</div>
</div>
</div>

  
  </div>
</article>


    <footer id="footer">
  <div class="footer-left">
    Copyright  &copy; 2024  MẤY KHI MẤY KHỈ 
  </div>
  <div class="footer-right">
    <nav>
      <ul>
         
        <li><a href="/post/intro">Intro</a></li>
         
        <li><a href="/post">Writings</a></li>
        
      </ul>
    </nav>
  </div>
</footer>


  </div>
</body>

<link rel="stylesheet" href=/lib/font-awesome/css/all.min.css>
<script src=/lib/jquery/jquery.min.js></script>
<script src=/js/main.js></script>
</html>
